{
    "A record exists for the current user in the user details table.": "Un enregistrement existe pour l'utilisateur actuel dans la table des détails de l'utilisateur.",
    "Address data not found.": "Données d'adresse non trouvées.",
    "Body must be a string.": "Le corps doit être une chaîne de caractères.",
    "Cities not found.": "Villes non trouvées.",
    "CityId must be a positive integer number.": "CityId doit être un nombre entier positif.",
    "CityName must be a string.": "Le nom de la ville doit être une chaîne de caractères.",
    "ClosedAtAfter must be a date in YYYY-MM-DD format.": "ClosedAtAfter doit être une date au format AAAA-MM-JJ.",
    "ClosedAtBefore must be a date in YYYY-MM-DD format.": "ClosedAtBefore doit être une date au format AAAA-MM-JJ.",
    "Couldn't store user's profile picture, display name or email.": "Impossible de stocker la photo de profil, le nom d'affichage ou l'email de l'utilisateur.",
    "CountryCode can only contain letters and underscores.": "Le code pays ne peut contenir que des lettres et des traits de soulignement.",
    "CountryCode is required.": "Le code pays est requis.",
    "CountryCode must be a string.": "Le code pays doit être une chaîne de caractères.",
    "CountryId is required.": "Le CountryId est requis.",
    "CountryId must be a positive integer number.": "CountryId doit être un nombre entier positif.",
    "CountryName must be a string.": "Le nom du pays doit être une chaîne de caractères.",
    "CreatedAtAfter must be a date in YYYY-MM-DD format.": "CreatedAtAfter doit être une date au format AAAA-MM-JJ.",
    "CreatedAtBefore must be a date in YYYY-MM-DD format.": "CreatedAtBefore doit être une date au format AAAA-MM-JJ.",
    "Creator is set automatically and should not be provided in the request.": "Le créateur est défini automatiquement et ne doit pas être fourni dans la demande.",
    "Creator must be a positive integer number.": "Le créateur doit être un nombre entier positif.",
    "CustomerId must be a positive integer number.": "CustomerId doit être un nombre entier positif.",
    "CustomerTypeId must be a positive integer number.": "CustomerTypeId doit être un nombre entier positif.",
    "DateOfBirth must be a valid date.": "La date de naissance doit être une date valide.",
    "DateOfBirth must be in YYYY-MM-DD format.": "La date de naissance doit être au format AAAA-MM-JJ.",
    "DisplayName must be a string.": "Le nom d'affichage doit être une chaîne de caractères.",
    "DisplayName must not exceed 255 characters.": "Le nom d'affichage ne doit pas dépasser 255 caractères.",
    "Either cityId or cityName must be provided, but not both, or both can be null.": "Soit cityId, soit cityName doit être fourni, mais pas les deux, ou les deux peuvent être nuls.",
    "Ensure that all keys and values are properly enclosed in double quotes.": "Assurez-vous que toutes les clés et les valeurs sont correctement entourées de guillemets doubles.",
    "Email must be between 5 and 255 characters.": "L'email doit être compris entre 5 et 255 caractères.",
    "Failed to delete the ticket due to an internal error.": "Échec de la suppression du ticket en raison d'une erreur interne.",
    "Failed to update the ticket.": "Échec de la mise à jour du ticket.",
    "FirstName must be a string.": "Le prénom doit être une chaîne de caractères.",
    "FirstName must not exceed 255 characters.": "Le prénom ne doit pas dépasser 255 caractères.",
    "FullAddress should not be provided in the request.": "L'adresse complète ne doit pas être fournie dans la demande.",
    "Gender types not found.": "Types de genre non trouvés.",
    "GenderId must be an integer between 0 and 9, inclusive.": "GenderId doit être un entier entre 0 et 9 inclus.",
    "GeoLatitude must be a float between -90 and 90.": "La latitude géographique doit être un flottant entre -90 et 90.",
    "GeoLongitude must be a float between -180 and 180.": "La longitude géographique doit être un flottant entre -180 et 180.",
    "Invalid email address.": "Adresse e-mail invalide.",
    "Invalid foreign key value.": "Valeur de clé étrangère invalide.",
    "Invalid JSON format.": "Format JSON invalide.",
    "Invalid URL detected: ": "URL invalide détectée : ",
    "IsConfidential must be either true or false.": "IsConfidential doit être vrai ou faux.",
    "IsPrivatePicture must be a boolean.": "IsPrivatePicture doit être un booléen.",
    "IsSupported must be a boolean.": "IsSupported doit être un booléen.",
    "LastName must be a string.": "Le nom de famille doit être une chaîne de caractères.",
    "LastName must not exceed 255 characters.": "Le nom de famille ne doit pas dépasser 255 caractères.",
    "Latitude is required.": "La latitude est requise.",
    "Latitude must be a number between -90 and 90.": "La latitude doit être un nombre compris entre -90 et 90.",
    "Limit must be a positive integer number and no more than 100.": "La limite doit être un nombre entier positif et ne doit pas dépasser 100.",
    "Location data not found.": "Données de localisation non trouvées.",
    "Longitude is required.": "La longitude est requise.",
    "Longitude must be a number between -180 and 180.": "La longitude doit être un nombre compris entre -180 et 180.",
    "MediaUrls must be a non-empty array.": "MediaUrls doit être un tableau non vide.",
    "MiddleName must be a string.": "Le deuxième prénom doit être une chaîne de caractères.",
    "MiddleName must not exceed 255 characters.": "Le deuxième prénom ne doit pas dépasser 255 caractères.",
    "No countries found.": "Aucun pays trouvé.",
    "No ticket found with the specified ticketId.": "Aucun ticket trouvé avec l'ID spécifié.",
    "Page must be a positive integer number.": "La page doit être un nombre entier positif.",
    "ProfilePictureUrl must be a string.": "ProfilePictureUrl doit être une chaîne de caractères.",
    "ProfilePictureUrl must be a valid URL.": "ProfilePictureUrl doit être une URL valide.",
    "PublishedAtAfter must be a date in YYYY-MM-DD format.": "PublishedAtAfter doit être une date au format AAAA-MM-JJ.",
    "PublishedAtBefore must be a date in YYYY-MM-DD format.": "PublishedAtBefore doit être une date au format AAAA-MM-JJ.",
    "Publisher must be a positive integer number.": "Le publisher doit être un nombre entier positif.",
    "Search must be a non-empty string.": "La recherche doit être une chaîne non vide.",
    "SearchCaseSensitive must be either true or false.": "SearchCaseSensitive doit être vrai ou faux.",
    "SearchFields must be a valid comma-separated list of fields [title, body, street, houseNumber, unit, cityName, regionName, postalCode, fullAddress, closeReason].": "SearchFields doit être une liste valide de champs séparés par des virgules [title, body, street, houseNumber, unit, cityName, regionName, postalCode, fullAddress, closeReason].",
    "StateId is required.": "StateId est requis.",
    "StateId must be a positive integer number.": "StateId doit être un nombre entier positif.",
    "States not found.": "États non trouvés.",
    "Ticket categories not found.": "Catégories de tickets non trouvées.",
    "TicketCategoryId must be a positive integer number.": "TicketCategoryId doit être un nombre entier positif.",
    "TicketId is required as a parameter.": "TicketId est requis en tant que paramètre.",
    "TicketId is required.": "TicketId est requis.",
    "TicketId must be a positive integer number.": "TicketId doit être un nombre entier positif.",
    "TicketId should not be provided in the request.": "TicketId ne doit pas être fourni dans la demande.",
    "TicketTitle must be a string.": "Le titre du ticket doit être une chaîne de caractères.",
    "Title is required.": "Le titre est requis.",
    "Title must be a string.": "Le titre doit être une chaîne de caractères.",
    "Title must not exceed 255 characters.": "Le titre ne doit pas dépasser 255 caractères.",
    "Unknown.": "Inconnu.",
    "UpdatedAtAfter must be a date in YYYY-MM-DD format.": "UpdatedAtAfter doit être une date au format AAAA-MM-JJ.",
    "UpdatedAtBefore must be a date in YYYY-MM-DD format.": "UpdatedAtBefore doit être une date au format AAAA-MM-JJ.",
    "Updator is set automatically and should not be provided in the request.": "L'updator est défini automatiquement et ne doit pas être fourni dans la demande.",
    "Updator must be a positive integer number.": "L'updator doit être un nombre entier positif.",
    "UserId is required.": "UserId est requis.",
    "UserId must be a positive integer.": "UserId doit être un entier positif.",
    "Validation error occurred.": "Une erreur de validation est survenue."
}
